#define _CRT_SECURE_NO_WARNINGS 1 
#include <stdio.h>
#include <stdlib.h>
//[]-下标引用操作符
//int main()
//{
////	int arr[10] = { 0, 1, 2, 3, 4, 5, 6, 7, 8, 9 };
////	//int *p = arr;
////    arr[9] = 0;
////	int *p = &arr[0];
////	int i = 0;
////	int sz = 0;
////
////	sz = sizeof(arr) / sizeof(arr[0]);
////	/*printf("%p\n",p);
////	printf("%p\n", &arr[0]);
////	printf("%p\n", &arr[1]);
////	printf("%p\n", &arr[9]);
////	printf("%d\n", arr[10]);
////	printf("%p\n", &arr[10]);*/
////	for (i = 0; i < sz; i++)
////	{
////		printf("%d ", *(p + i));
////	}
////
////	system("pause");
////}
//// 单目操作符
////位操作符
//// 按位异或操作符 ^ : 即二进制位数相同为0，不同为1;
////{
////	int a = 10; // 00000000 00000000 00000000 00001010
////	int b = 20;	// 00000000 00000000 00000000 00010100
////	int result1 = a^b;// 00000000 00000000 00000000 00011110 // 32 - 2;
////	printf("%d\n", result1);// 30
////
////	//不论任何一个值与0异或，其值就等于它的本身，因为0的二进制序列全是0
////	//不影响另一个值的二进制序列 ，序列中1还是1,0还是0
////	int c = 0;  // 00000000 00000000 00000000 00000000
////	int d = 10;
////	int e = -1;
////	int result2 = d ^ 0; 
////	int result3 = e ^ 0;
////	printf("%d\n", result2);//10
////	printf("%d\n", result3);//-1
////
//	//两个相同的值异或其结果为0
////	//由于一个数的二进制序列相同，所以比特位的每一位数相同，即异或为0；
////	int number1 = 10;
////	int result = number1^number1;
////	printf("%d\n", result); // 0
////
////	
////异或的应用  将两个数进行数值交换
//// 优点1：不创建临时变量，效率高
//// 优点2：可读性高
//	int a = 3;//00000000 00000000 00000000 00000011
//	int b = 7;//00000000 00000000 00000000 00000111
//	 a = a^b;
//	 b = a^b;  //相当于b = a^b^b 由上面可知b^b = 0, a^0 = a ,相当于把a的值赋给b;
//	 a = a^b; // 相当于a = (a^b)^(a^b^b) 同理 将b的值赋给a;
//	
//
//	system("pause");
//}


//int main()
////按位与 &  两个二进制序列各位数相同；则为1，否则为0；
//{
//	int a = 14; //00000000 00000000 00000000 00001110
//	int b = 7; // 00000000 00000000 00000000 00000111 
//	int c = a&b;
//	printf("%d", c);// 6 -- 0000000 00000000 00000000 00000110 
//	system("pause");
//}
//int main()
//{
////按位或 |  两个二进制序列中每一位上只要有一个为1；则为1，否则为0；
//		int a = 14; //00000000 00000000 00000000 00001110
//		int b = 7; // 00000000 00000000 00000000 00000111 
//		int c = a|b;
//		printf("%d", c);// 15 -- 0000000 00000000 00000000 00001111 
//		system("pause");
//}
//    （）函数调用操作符 
//void print()
//{
//	printf("hehe");
//}
//int main()
//{
//	print();//函数调用操作符
//	system("pause");
//}
// 关系操作符
//>
//<
//==
//>=
//<=
//!=
//逻辑操作符
//逻辑与 &&     逻辑或 || 
int main()
{
	// 逻辑&& 非0为真 0为假 。 只要一个数为0，则结果为假；全是非0，则结果为真
	//printf("%d\n", 1&& 2); //1
	//printf("%d\n", 1 && 0);//0
	//printf("%d\n", 1 && -1);//1
	//printf("%d\n", -1 && -2);//1
	//printf("%d\n", -1 && 0);//0

	//逻辑|| 非0为真 0为假 。 两数全为0 ，则结果为假； 否则为真
	printf("%d\n", 1 || 2); //1
	printf("%d\n", 1 || 0);//1
	printf("%d\n", 1 || -1);//1
	printf("%d\n", -1 || -2);//1
	printf("%d\n", -1 || 0);//1
	printf("%d\n", 0 || 0);//0



	system("pause");

}
